In [4]:
import pandas as pd
import numpy as np

In [5]:
bas_url = "https://datasets.imdbws.com/title.basics.tsv.gz"

In [6]:
aka_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

In [7]:
rat_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

In [8]:
bas = pd.read_csv(bas_url, sep='\t', low_memory=False)

In [9]:
aka = pd.read_csv(aka_url, sep='\t', low_memory=False)

In [10]:
rat = pd.read_csv(rat_url, sep='\t', low_memory=False)

In [11]:
bas = bas.replace({'\\N':np.nan})
bas.value_counts()

tconst      titleType     primaryTitle                                   originalTitle                                  isAdult  startYear  endYear  runtimeMinutes  genres
tt0025509   tvMiniSeries  Les Misérables                                 Les misérables                                 0        1934       1934     279             Drama                        1
tt21838520  tvMiniSeries  The British Invasion                           The British Invasion                           0        2010       2010     240             Documentary,History,Music    1
tt21811186  tvMiniSeries  Stories of the Mediterranean Forest            Stories of the Mediterranean Forest            0        2017       2017     50              Documentary                  1
tt21811888  tvSeries      Indian Predator: The Diary of a Serial Killer  Indian Predator: The Diary of a Serial Killer  0        2022       2022     123             Crime,Documentary,History    1
tt2181219   tvSeries      Les hommes de l'ombre                          Les hommes de l'ombre                          0        2012       2016     52              Drama                        1
                                                                                                                                                                                                 ..
tt1024810   tvSeries      The Boarding School                            El internado                                   0        2007       2010     75              Drama,Mystery,Thriller       1
tt1024817   tvSeries      Without Prejudice?                             Without Prejudice?                             0        2007       2007     90              Game-Show,Reality-TV         1
tt1024932   tvSeries      City Homicide                                  City Homicide                                  0        2007       2011     60              Crime,Drama,Mystery          1
tt10249352  tvSeries      Ultraman Taiga                                 Urutoraman Taiga                               0        2019       2019     25              Action,Adventure,Comedy      1
tt9916216   tvSeries      Kalyanam Mudhal Kadhal Varai                   Kalyanam Mudhal Kadhal Varai                   0        2014       2017     22              Romance                      1
Length: 46076, dtype: int64

In [12]:
aka = aka.replace({'\\N':np.nan})

In [13]:
rat = rat.replace({'\\N':np.nan})

In [14]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle           11
originalTitle          11
isAdult                 1
startYear         1247405
endYear           9222490
runtimeMinutes    6793573
genres             429792
dtype: int64

In [15]:
bas.dropna(subset=['runtimeMinutes'], inplace = True)

In [16]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear           45703
endYear           2478972
runtimeMinutes          0
genres              67996
dtype: int64

In [17]:
bas.dropna(subset=['genres'], inplace = True)

In [18]:
bas.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear           44363
endYear           2412541
runtimeMinutes          0
genres                  0
dtype: int64

In [19]:
bas.duplicated().sum()

0

In [20]:
bas['titleType'].value_counts()

tvEpisode       1112187
short            580518
movie            370525
video            176191
tvMovie           88804
tvSeries          87462
tvSpecial         16857
tvMiniSeries      16327
tvShort            9438
videoGame           308
Name: titleType, dtype: int64

In [21]:
bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy"
1172,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama"
...,...,...,...,...,...,...,...,...,...
9319951,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9320035,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama
9320076,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015,NaN,57,Documentary
9320103,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007,NaN,100,Documentary
9320136,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013,NaN,49,Documentary

In [22]:
bas = bas[bas['titleType'].str.contains
    ('tvEpisode|short|video|tvMovie|tvSeries|tvSpecial|tvMiniSeries|tvShort|videoGame')
    ==False]

In [23]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 370525 entries, 8 to 9320136
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          370525 non-null  object
 1   titleType       370525 non-null  object
 2   primaryTitle    370525 non-null  object
 3   originalTitle   370525 non-null  object
 4   isAdult         370525 non-null  object
 5   startYear       364601 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  370525 non-null  object
 8   genres          370525 non-null  object
dtypes: object(9)
memory usage: 28.3+ MB

In [24]:
bas['startYear'].value_counts()

2017    14235
2018    14175
2016    13848
2019    13837
2015    13354
        ...
1896        1
1894        1
1899        1
1904        1
2026        1
Name: startYear, Length: 128, dtype: int64

In [25]:
bas.dropna(subset=['startYear'], inplace = True)

In [26]:
bas['startYear'] = bas['startYear'].astype(int)

In [27]:
bas = bas[bas['startYear'] >= 2000]

In [28]:
bas = bas[bas['startYear'] <= 2022]

In [29]:
bas['startYear'].value_counts()

2017    14235
2018    14175
2016    13848
2019    13837
2015    13354
2014    12999
2013    12297
2021    11848
2012    11548
2020    11300
2011    10699
2010    10136
2022     9922
2009     9290
2008     8089
2007     6897
2006     6438
2005     5774
2004     5144
2003     4539
2002     4094
2001     3821
2000     3599
Name: startYear, dtype: int64

In [30]:
bas['startYear'] = bas['startYear'].astype(object)

In [31]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 217883 entries, 13079 to 9320136
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          217883 non-null  object
 1   titleType       217883 non-null  object
 2   primaryTitle    217883 non-null  object
 3   originalTitle   217883 non-null  object
 4   isAdult         217883 non-null  object
 5   startYear       217883 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  217883 non-null  object
 8   genres          217883 non-null  object
dtypes: object(9)
memory usage: 16.6+ MB

In [32]:
is_documentary = bas['genres'].str.contains('documentary',case=False)

In [33]:
bas = bas[~is_documentary]

In [34]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33607135 entries, 0 to 33607134
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.0+ GB

In [35]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [36]:
aka.duplicated().sum()

0

In [37]:
aka.isna().sum()

titleId                   0
ordering                  0
title                     5
region              1866767
language            6323621
types              28274120
attributes         33358307
isOriginalTitle        2187
dtype: int64

In [38]:
aka['region'].value_counts()

JP    4011891
FR    4010779
DE    4007481
IN    3942428
ES    3933815
       ...
CC          1
TV          1
NU          1
PW          1
NR          1
Name: region, Length: 247, dtype: int64

In [39]:
aka[aka['region'].str.contains('US') == True]

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0
...,...,...,...,...,...,...,...,...
33606807,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0
33606844,tt9916720,10,The Demonic Nun,US,NaN,tv,NaN,0
33606846,tt9916720,12,The Nun 2,US,NaN,imdbDisplay,NaN,0
33606863,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0
33606879,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0

In [40]:
aka = aka[aka['region'].str.contains('US') == True]

In [41]:
aka['region'].value_counts()

US    1362031
Name: region, dtype: int64

In [42]:
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [43]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1362031 entries, 5 to 33606879
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1362031 non-null  object
 1   ordering         1362031 non-null  int64
 2   title            1362031 non-null  object
 3   region           1362031 non-null  object
 4   language         3699 non-null     object
 5   types            965151 non-null   object
 6   attributes       45226 non-null    object
 7   isOriginalTitle  1360656 non-null  object
dtypes: int64(1), object(7)
memory usage: 93.5+ MB

In [44]:
keep = bas['tconst'].isin(aka['titleId'])
keep

34793       True
61095       True
67641       True
77935      False
86771       True
           ...
9319858     True
9319867     True
9319906    False
9319951     True
9320035    False
Name: tconst, Length: 144201, dtype: bool

In [45]:
bas = bas[keep]
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34793,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61095,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67641,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
86771,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
93907,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [46]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1240195 entries, 0 to 1240194
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1240195 non-null  object
 1   averageRating  1240195 non-null  float64
 2   numVotes       1240195 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.4+ MB

In [47]:
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1920
1  tt0000002            5.8       260
2  tt0000003            6.5      1728
3  tt0000004            5.6       173
4  tt0000005            6.2      2541

In [48]:
rat.duplicated().sum()

0

In [49]:
rat.isna().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [50]:
keepII = rat['tconst'].isin(aka['titleId'])
keepII

0           True
1           True
2          False
3          False
4           True
           ...
1240190    False
1240191     True
1240192    False
1240193    False
1240194    False
Name: tconst, Length: 1240195, dtype: bool

In [51]:
rat = rat[keepII]
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1920
1  tt0000002            5.8       260
4  tt0000005            6.2      2541
5  tt0000006            5.1       175
6  tt0000007            5.4       797

In [52]:
bas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 83087 entries, 34793 to 9319951
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          83087 non-null  object
 1   titleType       83087 non-null  object
 2   primaryTitle    83087 non-null  object
 3   originalTitle   83087 non-null  object
 4   isAdult         83087 non-null  object
 5   startYear       83087 non-null  object
 6   endYear         0 non-null      object
 7   runtimeMinutes  83087 non-null  object
 8   genres          83087 non-null  object
dtypes: object(9)
memory usage: 6.3+ MB

In [53]:
aka.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1362031 entries, 5 to 33606879
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1362031 non-null  object
 1   ordering         1362031 non-null  int64
 2   title            1362031 non-null  object
 3   region           1362031 non-null  object
 4   language         3699 non-null     object
 5   types            965151 non-null   object
 6   attributes       45226 non-null    object
 7   isOriginalTitle  1360656 non-null  object
dtypes: int64(1), object(7)
memory usage: 93.5+ MB

In [54]:
rat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 472371 entries, 0 to 1240191
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         472371 non-null  object
 1   averageRating  472371 non-null  float64
 2   numVotes       472371 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.4+ MB

In [55]:
import os
os.makedirs('Data/',exist_ok=True) 

os.listdir("Data/")

['.ipynb_checkpoints',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz']

In [56]:
bas.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [57]:
bas = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
bas.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [58]:
aka.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)

In [59]:
aka = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
aka.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [60]:
rat.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [61]:
rat = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
rat.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1920
1  tt0000002            5.8       260
2  tt0000005            6.2      2541
3  tt0000006            5.1       175
4  tt0000007            5.4       797

In [62]:
import os, time,json
import tmdbsimple as tmdb 
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['.ipynb_checkpoints',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz']

In [63]:
def write_json(new_data, filename): 
    """Appends a list of records (new_data) to a json file (filename). 
    Adapted from: https://www.geeksforgeeks.org/append-to-json-file-using-python/"""  
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
             file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

In [64]:
bas = pd.read_csv("Data/title_basics.csv.gz")

In [65]:
YEARS_TO_GET = [2000,2001]

In [66]:
errors = [ ]

In [90]:
# Start of OUTER loop
from tqdm.notebook import tqdm_notebook
for YEAR in tqdm_notebook(YEARS_TO_GET, desc = 'YEARS', position = 0):
    print(YEAR)

YEARS:   0%|          | 0/2 [00:00<?, ?it/s]

2000
2001

In [91]:
#Defining the JSON file to store results for year
JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'

In [92]:
# Check if file exists
file_exists = os.path.isfile(JSON_FILE)

In [93]:
# If it does not exist: create it
if file_exists == False:
# save an empty dict with just "imdb_id" to the new json file.
    with open(JSON_FILE,'w') as f:
        json.dump([{'imdb_id':0}],f)

In [96]:
#Saving new year as the current df
df = bas.loc[bas['startYear']==YEAR].copy()
# saving movie ids to list
movie_ids = df['tconst'].copy()

In [97]:
# Load existing data from json into a dataframe called "previous_df"
previous_df = pd.read_json(JSON_FILE)

In [98]:
# filter out any ids that are already in the JSON_FILE
movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]

In [99]:
def get_movie_with_rating(movie_id):
    """Adapted from source = https://github.com/celiao.tmdbsimple"""
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    
    # save the .info .releases dictionaries
    info = movie.info()
    
    releases = movie.releases()
    # Loop through countries in releases
    for c in releases['countries']:
        # if the country abbreviation==US
        if c['iso_3166_1'] == 'US':
            # save a "certification" key in info with the certification
            info['certification'] = c['certification']
    return info

In [100]:
    #Get index and movie id from list
    # INNER Loop
    for movie_id in tqdm_notebook(movie_ids_to_get,
                                  desc=f'Movies from {YEAR}',
                                  position=1,
                                  leave=True):
        try:
            # Retrieve then data for the movie id
            temp = get_movie_with_rating(movie_id)  
            # Append/extend results to existing file using a pre-made function
            write_json(temp,JSON_FILE)
            # Short 20 ms sleep to prevent overwhelming server
            time.sleep(0.02)
            
        except Exception as e:
            errors.append([movie_id, e])

Movies from 2001:   0%|          | 0/1532 [00:00<?, ?it/s]

In [101]:
final_year_df = pd.read_json(JSON_FILE)
final_year_df.to_csv(f"{FOLDER}final_tmdb_data_{YEAR}.csv.gz", compression="gzip", index=False)

In [102]:
print(f"- Total errors: {len(errors)}")

- Total errors: 1532